
{
  "experience": [
    {
      "id": 1,
      "company": "mPrest",
      "position": "Backend Developer",
      "location": "Petach Tikva, Israel",
      "duration": "Jun 2024 - Present",
      "logo": "\\data\\Pictures\\Logo's\\mprest.jfif",
      "description": "Worked on a classified defense technology project as part of a multidisciplinary team. Focused on building robust, high-performance backend systems using .NET technologies. Responsible for designing scalable APIs, optimizing system reliability, and ensuring secure data handling in mission-critical environments. Collaborated closely with frontend developers, QA engineers, and system architects to deliver features on tight deadlines while adhering to strict security protocols.",
      "achievements": [
      ],
      "technologies": ["Microservices", "TypeScript", "Node.js", "AWS", "Docker", "PostgreSQL"]
    },
    {
      "id": 2,
      "company": "Philips Medical Systems",
      "position": "Software Developer",
      "location": "Haifa, Israel",
      "duration": "Jan 2021 - May 2024",
      "logo": "\\data\\Pictures\\Logo's\\philips_logo.jfif",
      "description": "Led backend and full-stack development in medical imaging, modernizing monolithic systems into scalable web architectures. Owned core radiologist-facing apps, refactored legacy code, and led a POC that scaled data handling 20×. Also rebuilt a DICOM anonymization tool from a complex Python script into a clean, maintainable Angular + .NET solution.",
      "achievements": [
        "Application Owner - Knowledge focal point, design, and code owner, and team representative in product discussions",
        "Hackaton Team Lead -  SW developers, QA, and DevOps which developed a POC handles a data size of 20X more than it is currently capable of."
      ],
      "technologies": ["Angular", ".NET 6", "C#", "TypeScript", "DICOM", ".Net Framework", "WPF", "Agile"]
    },
    {
      "id": 3,
      "company": "Philips Medical Systems",
      "position": "Student Software Automation Developer",
      "location": "Haifa, Israel",
      "duration": "Sep 2018 - Dec 2020",
      "logo": "\\data\\Pictures\\Logo's\\philips_logo.jfif",
      "description": " Built and improved automation infrastructure and test suites for medical software. Worked with C#, Ranorex, and TestComplete using the Page Object pattern to ensure robust and maintainable UI tests.",
      "achievements": [
      ],
      "technologies": [" C#", "TestComplete", "Ranorex", "PageObject"]
    }
  ]
}
